# Imports

In [2]:
import pandas as pd
import numpy as np

In [3]:
labels = ['a', 'b', 'c']

minha_lista = [10, 20, 30]

arr = np.array([10, 20, 30])

d = {'a': 10, 'b': 20, 'c': 30}

In [4]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [5]:
pd.Series(data=labels, index=minha_lista)

10    a
20    b
30    c
dtype: object

In [6]:
pd.Series(labels, minha_lista)

10    a
20    b
30    c
dtype: object

In [7]:
d

{'a': 10, 'b': 20, 'c': 30}

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
ser1 = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])

In [10]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [11]:
ser2 = pd.Series([1, 2, 5, 4], ['USA', 'Germany', 'Italy', 'Japan'])

In [12]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [13]:
ser1['USA']

1

In [14]:
ser1['Germany']

2

In [15]:
ser1[['Germany', 'Japan']]

Germany    2
Japan      4
dtype: int64

In [16]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## Data Frames

In [17]:
from numpy.random import randn

In [19]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [20]:
df

          W         X         Y         Z
A -0.487043  0.292458 -0.029252 -0.226895
B -0.175181 -0.648093 -0.081850 -0.208764
C -0.367467  0.506700  0.720512 -0.557971
D  0.009223  0.331336  0.127649  0.482931
E  0.694884  0.306148 -1.031188 -0.156282

In [21]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df['W'] # Padrão série

A   -0.487043
B   -0.175181
C   -0.367467
D    0.009223
E    0.694884
Name: W, dtype: float64

In [ ]:
df[['W']]  #Padrão data frame

          W
A -0.487043
B -0.175181
C -0.367467
D  0.009223
E  0.694884

In [28]:
df['new'] = df['W'] + df['Y']

In [30]:
df

          W         X         Y         Z       new
A -0.487043  0.292458 -0.029252 -0.226895 -0.516295
B -0.175181 -0.648093 -0.081850 -0.208764 -0.257031
C -0.367467  0.506700  0.720512 -0.557971  0.353045
D  0.009223  0.331336  0.127649  0.482931  0.136873
E  0.694884  0.306148 -1.031188 -0.156282 -0.336304

In [31]:
df.drop('new', axis =1)

          W         X         Y         Z
A -0.487043  0.292458 -0.029252 -0.226895
B -0.175181 -0.648093 -0.081850 -0.208764
C -0.367467  0.506700  0.720512 -0.557971
D  0.009223  0.331336  0.127649  0.482931
E  0.694884  0.306148 -1.031188 -0.156282

In [32]:
df

          W         X         Y         Z       new
A -0.487043  0.292458 -0.029252 -0.226895 -0.516295
B -0.175181 -0.648093 -0.081850 -0.208764 -0.257031
C -0.367467  0.506700  0.720512 -0.557971  0.353045
D  0.009223  0.331336  0.127649  0.482931  0.136873
E  0.694884  0.306148 -1.031188 -0.156282 -0.336304

In [33]:
df2 = df.drop('new', axis=1)

In [36]:
df2

          W         X         Y         Z
A -0.487043  0.292458 -0.029252 -0.226895
B -0.175181 -0.648093 -0.081850 -0.208764
C -0.367467  0.506700  0.720512 -0.557971
D  0.009223  0.331336  0.127649  0.482931
E  0.694884  0.306148 -1.031188 -0.156282

In [34]:
df.drop('new', axis=1, inplace=True)

In [35]:
df

          W         X         Y         Z
A -0.487043  0.292458 -0.029252 -0.226895
B -0.175181 -0.648093 -0.081850 -0.208764
C -0.367467  0.506700  0.720512 -0.557971
D  0.009223  0.331336  0.127649  0.482931
E  0.694884  0.306148 -1.031188 -0.156282

In [37]:
df.loc['A']

W   -0.487043
X    0.292458
Y   -0.029252
Z   -0.226895
Name: A, dtype: float64

In [38]:
df.iloc[0]

W   -0.487043
X    0.292458
Y   -0.029252
Z   -0.226895
Name: A, dtype: float64

In [40]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A -0.487043 -0.029252
B -0.175181 -0.081850

In [41]:
df > 0

       W      X      Y      Z
A  False   True  False  False
B  False  False  False  False
C  False   True   True  False
D   True   True   True   True
E   True   True  False  False

In [42]:
df[df > 0]

          W         X         Y         Z
A       NaN  0.292458       NaN       NaN
B       NaN       NaN       NaN       NaN
C       NaN  0.506700  0.720512       NaN
D  0.009223  0.331336  0.127649  0.482931
E  0.694884  0.306148       NaN       NaN

In [44]:
df['Y'] > 0

A    False
B    False
C     True
D     True
E    False
Name: Y, dtype: bool

In [43]:
df[df['Y']> 0]

          W         X         Y         Z
C -0.367467  0.506700  0.720512 -0.557971
D  0.009223  0.331336  0.127649  0.482931

In [49]:
(df['Y']> 0 ) & (df['X'] > 0)

A    False
B    False
C     True
D     True
E    False
dtype: bool

In [51]:
df[(df['Y']> 0 ) & (df['X'] > 0)]

          W         X         Y         Z
C -0.367467  0.506700  0.720512 -0.557971
D  0.009223  0.331336  0.127649  0.482931